Enums/ЛБ_СтатусыТабеля.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ЛБ_СтатусыТабеля</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контроль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Факт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ЛБ_СтатусыТабеля/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;  
	
	ДанныеВыбора = Новый СписокЗначений;   
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыТабеля.Контроль")); 
	Если НЕ ПараметрыСеанса.ТекущийПользователь.ЭтоЛомбард Тогда
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыТабеля.Факт"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ЛБ_СтатусыТабеля.Проект"));
	КонецЕсли;
	

КонецПроцедуры
